# # 1.
# # 輸入一正整數，求其所有的因數。
# # 說明：36的因數為1, 2, 3, 4, 6, 9, 12, 18, 36,
# a = int(input("輸入一正整數:"))
# for i in range(1, a+1, 1):
#     if a % i == 0:
#         print(a, "的因數為:\n", i)

#
# 2.
# 迴圏的練習 - perfect_number
# 一個數字若等於其所有因數的總和，則此數為 perfectnumber。
# 找出100以內所有的完美數。
# 說明：6 的因數為1, 2, 3，6 = 1 + 2 + 3，故6為完美數。
# for i in range(1, 100+1):
#     na = 0
#     for n in range(1, i+1):
#         if i % n == 0:
#             na = n + na
#     na -= i
#     if na == i:
#         print(i)

# 3.
# 迴圏的練習 - amstrong
# Amstrong數是指一個三位數的整數，其各位數之立方和等於該數本身。
# 找出所有的Amstrong數。
# 說明：153 = 1 ^ 3 + 5 ^ 3 + 3 ^ 3，故153為Amstrong數。
# (2 ^ 3 表示 2 的 3 次方, 3 ^ 3 表示 3 的 3 次方)

# for i in range(100, 998+1):
#     n1 = i // 100
#     n2 = i // 10 % 10
#     n3 = i % 10
#     if (n1 * n1 * n1) + (n2 * n2 * n2) + (n3 * n3 * n3) == i:
#         print(i)

# # 4.
# # 迴圈的練習 - prime
# # 輸入一正整數，找出所有小於或等於的質數。
# num = int(input("請輸入一整數:"))
# for n in range(2, num+1):
#     x = 0
    # for i in range(2, n):
    #     if n % i != 0:
    #         x += 1
    # if x == n - 2:
    #     print(n)

# 5.
# 迴圈敘述的練習 - interest
# 某人A以10 % 單利投資100000元，某人B則以5 % 複利投資100000元。計算多少年後某人B的投資可以超過某人A，並將此時兩人錢數印出。(27年後)
# 提示：單利公式：P(1 + r * n)
# 複利公式：P(1 + r) ^ n
# P：本金，r：利率，n：多少年
# (備註︰(1+r) ^ n表示(1 + r)的n次方)
# n = 1
# while 100000 * (1 + (0.1 * n)) > 100000 * 1.05 ** n:
#     n += 1
# print(n, "年\n", 100000 * (1 + (0.1 * n)), "\n", 100000 * 1.05 ** n)

