# 1.選擇性敘述的練習 - season 輸入月份1~12 月，判斷相對應的季節春、夏、秋、冬並印出。若不在此範圍則印出”輸入錯誤”。
# (備註︰春天是用 3、4和 5月，不是1、2和 3月)
# a = int(input("輸入月份1~12月:"))
# print(a, "月")
# if 3 <= a <= 5:
#     print("春")
# elif 6 <= a <= 8:
#     print("夏")
# elif 9 <= a <= 11:
#     print("秋")
# elif 12 == a or a <= 2:
#     print("冬")
# else:
#     print("輸入錯誤")


# 2.選擇性敘述的練習-salary 輸入便利商店工讀生的工作時數，並計算其薪資。
# 60小時以內，時薪160元。
# 61~80小時，以時薪1.25倍計算。
# 81小時以上，以時薪1.5倍計算。
# 說明：薪資以累計方式計算。若工時為90小時，
# 則薪資為60*160 + 20*160*1.25 + 10*160*1.5元
# hour = float(input("輸入工讀生時數:"))
# if hour <= 60:
#     sal = hour * 160
#     print(hour, "小時", "薪資為:", sal, "元")
# elif 61 <= hour <= 80:
#     sal = 60 * 160
#     sh = (hour - 60) * 160 * 1.25
#     print(hour, "小時", "薪資為:", sal + sh, "元")
# elif hour >= 81:
#     sal = 60 * 160
#     sh = 20 * 160 * 1.25
#     shs = (hour - 80) * 160 * 1.5
#     print(hour, "小時", "薪資為:", sal + sh + shs, "元")
# else:
#     print("輸入錯誤")



# 3. 選擇性敘述的練習-electricity
# 輸入何種用電和度數，計算出需繳之電費。
# 電力公司使用累計方式來計算電費，分工業用電及家庭用電。
#                    家庭用電        工業用電
#
# 120度(含)以下         1.63元        0.5元
#
# 121~330(含)度        2.38元         0.5元
#
# 330度以上             3.52元         0.5元

# name = input("請輸入何種用電(家庭用電或工業用電):")
# name_f = "家庭用電"
# name_c = "工業用電"
# if name == name_f:
#     p = float(input("請輸入度數:"))
#     if p <= 120:
#         print(p * 1.63, "元")
#     elif 121 <= p <= 330:
#         pp = 120 * 1.63
#         pa = (p - 120) * 2.38
#         print(pp + pa, "元")
#     elif p > 330:
#         pp = 120 * 1.63
#         pa = 210 * 2.38
#         paa = (pp - 330) * 3.52
#         print(pp + pa + paa, "元")
# elif name == name_c:
#     p = float(input("請輸入度數:"))
#     print(p * 0.5)
# else:
#     print("輸入錯誤")


# 4.     選擇性敘述的練習-refund
# 輸入在某商店購物應付金額與實付金額。
# 實付金額小於應付金額，則印出”金額不足”。
# 實付金額等於應付金額，則印出”不必找錢”。
# 實付金額大於應付金額，則輸出找回金額最少的鈔票數和錢幣數。
# 假設幣值只有1000, 500, 100元紙鈔和50, 10, 5, 1元硬幣。
# 說明：若買了132元的商品，付1000元，應找回一張500元，三張100元，一個50元硬幣，一個10元硬幣，一個5元硬幣和三個1元硬幣。

# a = int(input("購物應付金額:"))
# b = int(input("實付金額:"))
# c = b - a
# if b > a:
#     th = 0
#     fh = 0
#     h = 0
#     f = 0
#     t = 0
#     fi = 0
#     o = 0
#     while c != 0:
#         if c >= 1000:
#             th += 1
#             c -= 1000
#         elif c >= 500:
#             fh += 1
#             c -= 500
#         elif c >= 100:
#             h += 1
#             c -= 100
#         elif c >= 50:
#             f += 1
#             c -= 50
#         elif c >= 10:
#             t += 1
#             c -= 10
#         elif c >= 5:
#             fi += 1
#             c -= 5
#         elif c >= 1:
#             o += 1
#             c -= 1
#     print("千元", th, "張", "五百", fh, "張", "一百", h, "張", "五十", f, "個", "十元", t, "個", "五元", fi, "個", "一元", o, "個")
# elif b < a:
#     print("金額不足")
# elif b == a:
#     print("不必找錢")

# 5.     迴圏的練習-password
#
# 出現”請輸入密碼”的提示，使用者有最多三次輸入的機會。
# 若輸入正確，則印出”密碼輸入正確，歡迎使用本系統！”。
# 若輸入不正確，再次出現”請輸入密碼”的提示。
# 若三次輸入不正確，則印出”密碼輸入超過三次！”，並結束程式的執行。

# for i in range(0, 3, 1):
#     a = int(input("請輸入密碼:"))
#     if a == 123456:
#         print("密碼輸入正確，歡迎使用本系統！")
#         break
# else:
#     print('密碼輸入超過三次！')

